#language:ru
Функционал: фрагмент

  @fragment
  Сценарий: Проверка полей тикета

    * На странице есть элемент "поле dueDate"
    * На странице есть элемент "поле title"
    * На странице есть элемент "поле queue"
    * На странице есть элемент "поле email"
    * На странице есть элемент "поле priority"
    * На странице есть элемент "поле description"
    * Проверим что элемент "поле dueDate" содержит текст "July 28, 2022"
    * Проверим что элемент "поле title" содержит текст "Last Test"
    * Проверим что элемент "поле queue" содержит текст "Some Product"
    * Проверим что элемент "поле email" содержит текст "admin@example.org"
    * Проверим что элемент "поле priority" содержит текст "3. Normal"
    * Проверим что элемент "поле description" содержит текст "Description"