#language:ru
Функционал: фрагмент

  @fragment
  Сценарий: Создание тикета

    * На странице есть элемент "кнопка создания нового тикета"
    * Нажимаем на кнопку "кнопка создания нового тикета"
    * Переход на страницу "CreateTicketPage"
    * На странице есть элемент "поле Queue"
    * На странице есть элемент "поле Problem"
    * На странице есть элемент "поле Description"
    * На странице есть элемент "поле Priority"
    * На странице есть элемент "поле DueDate"
    * На странице есть элемент "кнопка Submit Ticket"
    * Выберем в поле "поле Queue" значение "Some Product"
    * Вводим в поле "поле Problem" значение "Last Test"
    * Вводим в поле "поле Description" значение "Description"
    * Выберем в поле "поле Priority" значение "3. Normal"
    * Вводим в поле "поле DueDate" значение "2022-07-28 12:34:56"
    * Нажимаем на кнопку "кнопка Submit Ticket"